In [21]:
import pandas as pd
import pyodbc

In [23]:
# Parameters
# Parameters
server_name = 'DESKTOP-SRKG50F\SHANKAR'
DATABASE_NAME = 'AdventureWorks2019'

# Create the connection
conn = pyodbc.connect("""
            DRIVER={{SQL Server Native Client 11.0}};
            SERVER={0};
            DATABASE={1};
            Trusted_Connection=yes""".format(server_name,DATABASE_NAME))

# query db
sql = """
SELECT *
FROM Person.BusinessEntityAddress

"""
df = pandas.read_sql(sql,conn)
df.head()

,BusinessEntityID,AddressID,AddressTypeID,rowguid,ModifiedDate
0,1,249,2,3A5D0A00-6739-4DFE-A8F7-844CD9DEE3DF,2014-09-12 11:15:06.967
1,2,293,2,84AE7057-EDF4-4C51-8B8D-3AEAEFBFB4A1,2014-09-12 11:15:06.967
2,3,224,2,3C915B31-7C05-4A05-9859-0DF663677240,2014-09-12 11:15:06.967
3,4,11387,2,3DC70CC4-3AE8-424F-8B1F-481C5478E941,2014-09-12 11:15:06.967
4,5,190,2,C0ED2F68-937B-4594-9459-581AC53C98E3,2014-09-12 11:15:06.967